package com.github.hummel.mpp.course.dao

import com.github.hummel.mpp.course.connection
import com.github.hummel.mpp.course.entity.Author
import java.sql.SQLException

object AuthorDao {
	fun initTable() {
		val sql = """
		CREATE TABLE IF NOT EXISTS authors (
			`id` INT PRIMARY KEY AUTO_INCREMENT,
			`name` VARCHAR(255) NOT NULL,
			`desc` TEXT NOT NULL,
			`image` VARCHAR(255) NOT NULL
		);
		""".trimIndent()

		try {
			connection.createStatement().execute(sql)
		} catch (e: SQLException) {
			e.printStackTrace()
		}

		val sqlFill = """INSERT
			INTO authors (`name`, `desc`, `image`)
			VALUES (?, ?, ?)
		""".trimIndent()

		val names = listOf(
			"Адам Міцкевіч", "Максім Багдановіч", "Уладзімір Караткевіч", "Якуб Колас", "Янка Купала",
		)

		val descs = listOf(
			"""
			Адам Міцкевіч, адзін з найвялікшых польскіх паэтаў і асветнікаў, нарадзіўся 24 снежня 1798 года ў фальварку Завоссе на Навагрудчыне, у Літоўскай губерні Расійскай імперыі. Яго адукацыя пачалася ў Навагрудскай дамініканскай школе, а затым ён працягнуў навучанне ў Віленскім універсітэце, дзе стаў актыўным удзельнікам патрыятычных гурткоў філаматаў і філарэтаў. У гэты перыяд Міцкевіч напісаў свае першыя творы, якія адлюстроўвалі яго любоў да роднай зямлі і жаданне свабоды для беларусаў і палякаў.
			Пасля заканчэння ўніверсітэта Міцкевіч працаваў настаўнікам у Коўна, аднак яго палітычная актыўнасць прывяла да арышту ў 1823 годзе за ўдзел у "Справе філаматаў". Ён быў заключаны ў турму, а потым высланы з Літвы. У 1829 годзе паэт пакінуў Расійскую імперыю і пераехаў у Еўропу, дзе жыў у Германіі, Італіі і Францыі. У Парыжы ён стаў прафесарам славянскай літаратуры ў "Каледж дэ Франс" і сустракаўся з вядомымі асобамі свайго часу, у тым ліку з Фрыдэрыкам Шапэнам.
			Міцкевіч вядомы сваімі значнымі літаратурнымі творамі, сярод якіх "Дзяды" і "Пан Тадэвуш", якія сталі сімваламі польскага нацыянальнага адраджэння. Яго паэмы адлюстроўваюць не толькі асабістую трагедыю, але і шырокія гістарычныя падзеі, звязаныя з барацьбой за незалежнасць. Ён таксама пісаў прамовы і артыкулы на палітычныя тэмы, заклікаючы да аднаўлення польскай дзяржаўнасці.
			У 1855 годзе Міцкевіч выехаў у Канстантынопаль, дзе планаваў арганізаваць польскі легіён для ўдзелу ў Крымскай вайне. На жаль, яго жыццё скончылася 26 лістапада таго ж года падчас эпідэміі халеры. Перад смерцю ён сказаў: "Няхай любяць адно аднаго", што падкрэслівае яго гуманізм і жаданне міру.
			Адам Міцкевіч застаецца адной з найважнейшых фігур у беларускай і польскай літаратуры. Яго творы працягваюць натхняць многіх людзей і сягнуць далёка за межы яго эпохі. Яго спадчына жыве не толькі ў літаратуры, але і ў культурным жыцці Беларусі і Польшчы, дзе яго лічаць нацыянальным паэтам.
			""".trimIndent(),

			"""
			Максім Багдановіч, вядомы беларускі паэт і літаратурны дзеяч, нарадзіўся 27 лістапада 1891 года ў Менску. У яго сям'і панавала культурная атмасфера: бацька, Адам Багдановіч, быў этнографам, а маці, Марыя, настаўніцай. Праз некалькі гадоў пасля нараджэння Максіма сям'я пераехала ў Ніжні Ноўгарод, дзе ён атрымаў хатнюю адукацыю і пачаў цікавіцца беларускай культурай і мовай. У 1907 годзе ён дэбютаваў у літаратуры з апавяданнем "Музыка", якое было надрукавана ў газеце "Наша Ніва".
			У 1909 годзе Багдановіч захварэў на сухоты, што значна паўплывала на яго жыццё і творчасць. Пасля заканчэння гімназіі ў 1911 годзе ён наведаў Вільню, дзе знайшоў натхненне для сваіх твораў, у тым ліку для верша "Слуцкія ткачыхі". У гэты перыяд ён актыўна займаўся літаратурнай дзейнасцю і супрацоўнічаў з вядомымі дзеячамі беларускага Адраджэння.
			У 1913 годзе выйшаў яго першы зборнік вершаў "Вянок", які стаў важным этапам у развіцці беларускай літаратуры. Багдановіч выкарыстоўваў элементы імпрэсіянізму і сымбалізму ў сваіх творах, што адлюстроўвала яго глыбокае пачуццё роднай зямлі і яе гісторыі. У гэты час ён таксама пісаў прамовы і артыкулы, якія заклікалі да аднаўлення беларускай культуры.
			У 1916 годзе Максім вярнуўся ў Менск, дзе працаваў у губернскім харчовым камітэце і працягваў пісаць. Яго творы гэтага перыяду, такія як "Страцім-лебедзь" і "Пагоня", адлюстроўваюць яго глыбокую любоў да Беларусі і жаданне яе свабоды. Аднак стан яго здароўя пагоршыўся, і ён быў вымушаны паехаць у Крым для лячэння.
			Максім Багдановіч памёр 25 траўня 1917 года ў Ялце ў ўзросце 25 гадоў. Яго спадчына аказала значны ўплыў на развіццё беларускай літаратуры, а творы працягваюць натхняць новыя пакаленні чытачоў. Ён лічыцца адным з заснавальнікаў сучаснай беларускай літаратуры і мовы.
			""".trimIndent(),

			"""
			Уладзімір Караткевіч, адзін з самых вядомых беларускіх пісьменнікаў, нарадзіўся 26 лістапада 1930 года ў горадзе Орша. Яго сям'я была інтэлігенцкай: бацька, Сямён Цімафеевіч, працаваў інспектарам у райфінаддзеле, а маці, Надзея Васільеўна, была настаўніцай. У гады Другой сусветнай вайны Караткевіч знаходзіўся ў эвакуацыі, што аказала значны ўплыў на яго светапогляд і творчасць. Падчас вайны ён страціў старэйшага брата, што таксама адбілася на яго пісьменніцкай дзейнасці.
			Пасля заканчэння школы ў 1949 годзе Уладзімір паступіў на рускае аддзяленне філалагічнага факультэта Кіеўскага дзяржаўнага універсітэта. У гэты час ён актыўна займаўся літаратурнай дзейнасцю і пачаў пісаць вершы і апавяданні. Дэбютаваў у друку ў 1951 годзе з творамі, якія адлюстроўвалі яго цікавасць да беларускай гісторыі і культуры. У 1954 годзе ён скончыў універсітэт і пачаў працаваць настаўнікам.
			Караткевіч стаў вядомым дзякуючы сваім гістарычным раманам і аповесцям, сярод якіх "Дзікае паляванне караля Стаха" і "Цыганскі кароль". Яго творы адрозніваюцца глыбокім гістарычным аналізам і мастацкім майстэрствам. Ён таксама пісаў п'есы і дзіцячыя кнігі, у якіх спалучаў элементы фальклору і сучаснай літаратуры. У 1970-х гадах яго творчасць атрымала шырокае прызнанне, а Караткевіч стаў адным з самых уплывовых пісьменнікаў Беларусі.
			Уладзімір Караткевіч актыўна ўдзельнічаў у грамадскім жыцці краіны і быў членам Саюза пісьменнікаў Беларусі. Яго літаратурная дзейнасць была адзначана шматлікімі прэміямі, у тым ліку Дзяржаўнай прэміяй БССР імя Якуба Коласа. Ён таксама вучыўся на Вышэйшых літаратурных курсах у Маскве, што дапамагло яму пашырыць свой літаратурны кругазор.
			Уладзімір Караткевіч памёр 25 ліпеня 1984 года ў Мінску. Яго спадчына застаецца важнай часткай беларускай культуры, а творы працягваюць натхняць новыя пакаленні чытачоў. Ён лічыцца адным з найвялікшых беларускіх пісьменнікаў XX стагоддзя, які зрабіў значны ўнёсак у развіццё нацыянальнай літаратуры.
			""".trimIndent(),

			"""
			Якуб Колас, сапраўднае імя якога Канстанцін Міхайлавіч Міцкевіч, нарадзіўся 22 кастрычніка (3 лістапада) 1882 года ў вёсцы Акінчыцы, што ў Мінскай губерні. Ён вырас у сям'і лесніка, што спрыяла яго любоўі да прыроды і сельскага жыцця. У 1902 годзе Якуб скончыў Несвижскую настаўніцкую семінарыю і пачаў працаваць настаўнікам у Ганцавічах. У гэты час ён пачаў пісаць вершы і апавяданні, якія адлюстроўвалі яго цікавасць да беларускай культуры і мовы.
			Першае публікацыя Якуба Коласа адбылася ў 1906 годзе, калі ў газеце "Наша доля" было надрукавана яго вершаванае твор. У гэты ж час ён прыняў удзел у нелегальным настаўніцкім з'ездзе, за што быў звольнены з працы і правёў некаторы час у полулегальным становішчы. У 1908 годзе ён быў арыштаваны і асуджаны на тры гады турмы за сваю літаратурную дзейнасць, дзе працягваў пісаць і працаваць над паэмамі "Сымон-музыка" і "Новая зямля".
			Пасля вызвалення Колас вярнуўся да настаўніцтва і актыўна займаўся літаратурнай дзейнасцю. У 1926 годзе яму было прысвоена званне народнага паэта Беларусі, а ў 1928 годзе ён стаў акадэмікам АН БССР. Яго творчасць уключае шырокі спектр жанраў: ад паэзіі і прозы да драматургіі. Сярод самых вядомых яго твораў — паэмы "Новая зямля", "Сымон-музыка" і зборнікі казак "Казкі жыцця".
			У гады Другой сусветнай вайны Колас працягваў пісаць, яго творы адлюстроўвалі жахі вайны і жаданне міру. За свае літаратурныя заслугі ён атрымаў Дзяржаўную прэмію СССР у 1946 годзе. Пасля вайны ён вярнуўся ў Мінск, дзе працягваў актыўную літаратурную і грамадскую дзейнасць.
			Якуб Колас памёр 13 жніўня 1956 года ў Мінску. Яго спадчына застаецца важнай часткай беларускай культуры, а творы працягваюць натхняць новыя пакаленні чытачоў. Ён лічыцца адным з заснавальнікаў сучаснай беларускай літаратуры і важным прадстаўніком нацыянальнага самасвядомасці беларусаў.
			""".trimIndent(),

			"""
			Янка Купала, сапраўднае імя якога Іван Дамінікавіч Луцэвіч, нарадзіўся 7 ліпеня 1882 года ў фальварку Вязынка, што ў Віленскай губерні. Ён вырас у сям'і арандатара, што спрыяла яго ранняму знаёмству з народным жыццём і культурай. Атрымаўшы пачатковую адукацыю, Янка працаваў на розных працах, уключаючы настаўніцтва і працу на вінокурным заводзе. У гэты перыяд ён пачаў пісаць вершы і апавяданні, якія адлюстроўвалі яго цікавасць да беларускай мовы і фальклору.
			Янка Купала стаў вядомым дзякуючы сваім паэтычным зборнікам, якія выходзілі ў перыяд з 1908 па 1913 год. Сярод іх "Жалейка", "Гусляр" і "Шляхам жыцця". Ён таксама актыўна супрацоўнічаў з першай беларускай газетай "Наша Ніва", дзе публікаваў свае творы і артыкулы. Яго паэмы "Адвечная песня" і "Сон на кургане", а таксама драма "Паўлінка" сталі класікай беларускай літаратуры і заклалі асновы нацыянальнага тэатра.
			У 1919 годзе Янка Купала пераехаў у Мінск, дзе працягваў пісаць і працаваць у розных літаратурных установах. Яго творчасць адлюстроўвала цяжкія часы для Беларусі — Першую сусветную вайну, рэвалюцыі і грамадзянскую вайну. Ён стаў адным з галоўных прадстаўнікоў беларускага нацыянальнага адраджэння, выступаючы за правы беларусаў і аднаўленне нацыянальнай культуры.
			У гады Другой сусветнай вайны Янка Купала быў эвакуіраваны ў Татарстан, адкуль вярнуўся ў Маскву. На жаль, яго жыццё скончылася трагічна: 28 чэрвеня 1942 года ён загінуў у гасцініцы ў Маскве падчас няшчаснага выпадку. Пісьменнік не дажыў да свайго 60-гадовага юбілею некалькі дзён.
			Янка Купала лічыцца класікам беларускай літаратуры і духоўным лідэрам нацыянальнага руху. Яго творы працягваюць натхняць многіх беларусаў і застаюцца важнай часткай культурнай спадчыны краіны. Ён заставаўся актыўным у грамадскім жыцці да апошніх дзён свайго жыцця, пакінуўшы пасля сябе багатую літаратурную спадчыну.
			""".trimIndent()
		)

		val images = listOf(
			"authors/mickiewicz.jpg",
			"authors/bahdanowicz.jpg",
			"authors/karatkiewicz.jpg",
			"authors/jakub.jpg",
			"authors/kupala.jpg",
		)

		try {
			val pstmt = connection.prepareStatement(sqlFill)

			for (i in names.indices) {
				pstmt.setString(1, names[i])
				pstmt.setString(2, descs[i])
				pstmt.setString(3, images[i])
				pstmt.addBatch()
			}

			pstmt.executeBatch()
		} catch (e: SQLException) {
			e.printStackTrace()
		}
	}

	fun findAllAuthors(): List<Author> {
		val sql = "SELECT * FROM authors"

		try {
			val stmt = connection.createStatement()
			val rs = stmt.executeQuery(sql)

			val authors = mutableListOf<Author>()
			while (rs.next()) {
				authors.add(
					Author(
						id = rs.getInt("id"),
						name = rs.getString("name"),
						desc = rs.getString("desc"),
						image = rs.getString("image"),
					)
				)
			}
			return authors
		} catch (e: SQLException) {
			e.printStackTrace()

			return emptyList()
		}
	}

	fun findAuthorById(authorId: Int): Author? {
		val sql = "SELECT * FROM authors WHERE `id` = ?"

		return try {
			val pstmt = connection.prepareStatement(sql)
			pstmt.setInt(1, authorId)

			val rs = pstmt.executeQuery()
			if (rs.next()) {
				Author(
					id = rs.getInt("id"),
					name = rs.getString("name"),
					desc = rs.getString("desc"),
					image = rs.getString("image"),
				)
			} else {
				null
			}
		} catch (e: SQLException) {
			e.printStackTrace()

			null
		}
	}
}